{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Conv2D",
      "config": {
        "filters": 8,
        "kernel_size": [3, 3],
        "activation": "relu",
        "input_shape": [100, 100, 3],
        "name": "conv2d"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "pool_size": [2, 2],
        "name": "max_pooling2d"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "filters": 16,
        "kernel_size": [3, 3],
        "activation": "relu",
        "name": "conv2d_1"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "pool_size": [2, 2],
        "name": "max_pooling2d_1"
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "units": 32,
        "activation": "relu",
        "name": "dense"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "units": 1,
        "activation": "sigmoid",
        "name": "dense_1"
      }
    }
  ],
  "keras_version": "2.12.0",
  "backend": "tensorflow"
}
